Oussnmr/kage-eyes/firmware/sdkconfig.defaults
# Kage Eyes — ESP32-S3R8, 8 MB octal PSRAM, 16 MB flash
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# PSRAM: octal, 80 MHz, available to malloc; memtest off to save boot time
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MEMTEST=n
# flash: octal-capable board; QIO fast
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# Wi-Fi credentials are provisioned by Improv over USB Serial/JTAG; no SoftAP.
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_BT_ENABLED=n
# generous stack for the display task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
# Two persistent internal DMA buffers (draw + software rotation): 47,104 bytes.
# The QSPI panel uses partial rendering, not RGB full-frame/tearing modes.
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=32

# HTTPS fallback to the M920q Funnel uses the ESP x509 certificate bundle.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Remote HTTPS/Tailscale Funnel memory tuning.
# Current Let's Encrypt chains can require an RSA-4096 verification step.
# Keep the full 16 KB RX record size for standards-compliant servers, but make
# TLS buffers dynamic and place mbedTLS allocations in the board's 8 MB PSRAM
# so certificate verification does not exhaust fragmented internal heap.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# The hardware AES path needs internal DMA buffers even when mbedTLS uses
# PSRAM. OTA's TLS handshake ran out of that memory on the live device.
CONFIG_MBEDTLS_HARDWARE_AES=n
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
